Revit.Elements.Level.InternalSetName(System.String,System.String)
Mutate the name of the level
name:  the name we want to set the level to have
oldname:  the oldname we tried to set this level to in the past,
we retrieve this from trace